Public Attributes | List of all members
API_Interval Struct Reference
Element Manager
Describes an interval with handling possible periodicity. More...
#include <APIdefs_Base.h>
 Public Attributes
 double  | lower
Lower bound of the interval.
 double  | upper
Upper bound of the interval.
 double  | periodicity
Interval Length if it is circular.
Detailed Description
Describes an interval with handling possible periodicity.
Remarks
None